[
  {
    "name": "Burns",
    "image": "burn.png",
    "steps": [
      "Cool the burn under running cool (not cold) water for at least 10 minutes.",
      "Remove any jewelry or tight clothing near the area.",
      "Cover the burn with a sterile, non-stick dressing or clean cloth.",
      "Do not apply creams, butter, or ointments."
    ]
  },
  {
    "name": "Cuts and Bleeding",
    "image": "blood.png",
    "steps": [
      "Apply pressure to stop the bleeding using a clean cloth or bandage.",
      "Rinse the wound gently with clean water.",
      "Cover with a sterile dressing or bandage.",
      "Seek medical help if bleeding is severe or won't stop."
    ]
  },
  {
    "name": "Nosebleed",
    "image": "nose-bleeding.png",
    "steps": [
      "Sit upright and lean forward slightly (do not tilt head back).",
      "Pinch the soft part of the nose for 10 to 15 minutes.",
      "Breathe through the mouth and remain calm.",
      "If bleeding continues after 20 minutes, seek medical help."
    ]
  },
  {
    "name": "Fracture (Broken Bone)",
    "image": "broken-bone.png",
    "steps": [
      "Keep the injured area still and supported with a splint or soft padding.",
      "Do not try to realign the bone.",
      "Apply an ice pack wrapped in cloth to reduce swelling.",
      "Seek emergency medical help immediately."
    ]
  },
  {
    "name": "Sprain or Strain",
    "image": "leg.png",
    "steps": [
      "Rest the injured limb and avoid putting weight on it.",
      "Apply ice for 15 to 20 minutes every hour for the first 24 hours.",
      "Wrap with an elastic bandage to reduce swelling.",
      "Elevate the limb above heart level if possible."
    ]
  },
  {
    "name": "Choking (Adult)",
    "image": "swallow.png",
    "steps": [
      "Ask, 'Are you choking?' and encourage coughing if possible.",
      "If unable to breathe or speak, perform 5 back blows between shoulder blades.",
      "If still choking, perform 5 abdominal thrusts (Heimlich maneuver).",
      "Repeat until the object is expelled or help arrives."
    ]
  },
  {
    "name": "Poisoning",
    "image": "poison.png",
    "steps": [
      "Do not induce vomiting unless instructed by a professional.",
      "Call emergency services or poison control immediately.",
      "Provide details about the substance taken and the amount.",
      "Do not give food or drink unless advised."
    ]
  },
  {
    "name": "Heatstroke",
    "image": "hot.png",
    "steps": [
      "Move the person to a cool, shaded area.",
      "Cool the body with wet cloths or a fan.",
      "Give small sips of water if the person is conscious.",
      "Call emergency services immediately if confusion or unconsciousness occurs."
    ]
  },
  {
    "name": "Hypothermia",
    "image": "hypothermia.png",
    "steps": [
      "Move the person to a warm, dry place.",
      "Remove wet clothing and wrap them in blankets.",
      "Give warm (not hot) drinks if they are conscious.",
      "Seek medical attention immediately."
    ]
  },
  {
    "name": "Insect Bite or Sting",
    "image": "mosquito.png",
    "steps": [
      "Remove the stinger if visible (scrape it out, do nott pinch).",
      "Wash the area with soap and water.",
      "Apply a cold compress to reduce swelling.",
      "Seek medical help if there is an allergic reaction (swelling, difficulty breathing)."
    ]
  },
  {
    "name": "Snake Bite",
    "image": "man.png",
    "steps": [
      "Keep the person still and calm to slow the spread of venom.",
      "Keep the bitten area below heart level.",
      "Do not suck out venom or apply a tourniquet.",
      "Call emergency services immediately."
    ]
  },
  {
    "name": "Electric Shock",
    "image": "shock.png",
    "steps": [
      "Do not touch the person if they are still in contact with electricity.",
      "Turn off the power source first or move it away using a non-conductive object.",
      "Check for breathing and pulse, and perform CPR if needed.",
      "Call emergency services immediately."
    ]
  },
  {
    "name": "Seizure",
    "image": "seizure.png",
    "steps": [
      "Clear the area of sharp or hard objects.",
      "Do not hold the person down or put anything in their mouth.",
      "Place something soft under their head.",
      "After the seizure, turn them on their side and keep them calm."
    ]
  },
  {
    "name": "Eye Injury",
    "image": "eye_injury.png",
    "steps": [
      "Do not rub or apply pressure to the eye.",
      "Rinse gently with clean water or saline if a small object is inside.",
      "If a large object is embedded, do not remove it—stabilize and seek medical help immediately.",
      "Cover both eyes to reduce movement until help arrives."
    ]
  },
  {
    "name": "Fainting",
    "image": "faint.png",
    "steps": [
      "Lay the person on their back and elevate their legs.",
      "Loosen tight clothing.",
      "If they do not regain consciousness within one minute, call for help.",
      "Check for breathing and pulse."
    ]
  }
]
